rails/rails_book_it_app/app/views/books/_book.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "books_categories" ON "categories"."id" = "books_categories"."category_id" WHERE "books_categories"."book_id" = ?  [["book_id", 1]]
---

  <% book.categories.each do |category| %>