rails/rails_book_it_app/app/views/books/show.html.erb


<% @book.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]