rails/rails_book_it_app/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "summary", "published_date", "image_path", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save