rails/rails_book_it_app/app/controllers/reviews_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @book = Book.find(params[:book_id])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "comment", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["rating", 9], ["comment", "It is a 9."], ["book_id", 1], ["created_at", "2023-02-10 00:29:02.564966"], ["updated_at", "2023-02-10 00:29:02.564966"]]
---
  def create
    @book = Book.find(params[:book_id])

    review = @book.reviews.new(review_params)

    if review.save