rails/C9-exercises/c9-exercise-one/app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])

    if @post.update(title: params[:post][:title], body: params[:post][:body])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test"], ["body", "test"], ["updated_at", "2023-02-07 01:39:43.906250"], ["id", 1]]